Австралия/src/Documents/FixedAssetDepreciationChanges/FixedAssetDepreciationChanges.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>FixedAssetDepreciationChanges</name>
  <registerRecords>InformationRegister.FixedAssetParameters</registerRecords>
  <registerRecords>InformationRegister.AccountingEntriesData</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesSimple</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntries</registerRecords>
  <registerRecords>InformationRegister.DocumentAccountingEntriesStatuses</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpenses</registerRecords>
  <registerRecords>AccumulationRegister.FixedAssets</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesCompound</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <tabularSections>
    <name>FixedAssets</name>
    <attributes>
      <name>FixedAsset</name>
      <type>
        <types>CatalogRef.FixedAssets</types>
      </type>
    </attributes>
    <attributes>
      <name>UsagePeriodForDepreciationCalculation</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AmountOfProductsServicesForDepreciationCalculation</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CostForDepreciationCalculation</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ApplyInCurrentMonth</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>GLExpenseAccount</name>
      <type>
        <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>BusinessLine</name>
      <type>
        <types>CatalogRef.LinesOfBusiness</types>
      </type>
    </attributes>
    <attributes>
      <name>StructuralUnit</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>CostForDepreciationCalculationBeforeChanging</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RevaluationAccount</name>
      <type>
        <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>Project</name>
      <type>
        <types>CatalogRef.Projects</types>
      </type>
    </attributes>
    <attributes>
      <name>ExpenseItem</name>
      <type>
        <types>CatalogRef.IncomeAndExpenseItems</types>
      </type>
    </attributes>
    <attributes>
      <name>RevaluationItem</name>
      <type>
        <types>CatalogRef.IncomeAndExpenseItems</types>
      </type>
    </attributes>
    <attributes>
      <name>RegisterExpense</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>RegisterRevaluation</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/InformationRegisters/FixedAssetParameters/FixedAssetParameters.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>FixedAssetParameters</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>AmountOfProductsServicesForDepreciationCalculation</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>CostForDepreciationCalculation</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ApplyInCurrentMonth</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </resources>
  <resources>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </resources>
  <resources>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </resources>
  <resources>
    <name>UsagePeriodForDepreciationCalculation</name>
    <comment>Useful life</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>GLExpenseAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>FixedAsset</name>
    <type>
      <types>CatalogRef.FixedAssets</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/FixedAssetDepreciationMethods/FixedAssetDepreciationMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>FixedAssetDepreciationMethods</name>
  <enumValues>
    <name>Linear</name>
  </enumValues>
  <enumValues>
    <name>ProportionallyToProductsVolume</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/DefaultIncomeAndExpenseItems/DefaultIncomeAndExpenseItems.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>DefaultIncomeAndExpenseItems</name>
  <predefined>
    <items>
      <name>Expenses</name>
      <description>Administrative expenses</description>
    </items>
    <items>
      <name>BankFees</name>
      <description>Bank fees (expense account)</description>
    </items>
    <items>
      <name>COGS</name>
      <description>COGS</description>
    </items>
    <items>
      <name>LoanCommissionExpenses</name>
      <description>Commission expenses on loans borrowed</description>
    </items>
    <items>
      <name>LoanCommissionIncome</name>
      <description>Commission income on loans lent</description>
    </items>
    <items>
      <name>DepreciationCharge</name>
      <description>Depreciation charge</description>
    </items>
    <items>
      <name>DiscountAllowed</name>
      <description>Discount allowed</description>
    </items>
    <items>
      <name>DiscountReceived</name>
      <description>Discount received</description>
    </items>
    <items>
      <name>FXIncome</name>
      <description>Foreign currency exchange gain</description>
    </items>
    <items>
      <name>FXExpenses</name>
      <description>Foreign currency exchange loss</description>
    </items>
    <items>
      <name>InterestExpenses</name>
      <description>Interest expenses on loans borrowed</description>
    </items>
    <items>
      <name>InterestIncome</name>
      <description>Interest income</description>
    </items>
    <items>
      <name>ManufacturingOverheads</name>
      <description>Manufacturing overheads</description>
    </items>
    <items>
      <name>OtherExpenses</name>
      <description>Other expenses</description>
    </items>
    <items>
      <name>OtherIncome</name>
      <description>Other income</description>
    </items>
    <items>
      <name>PayrollExpenses</name>
      <description>Payroll expenses</description>
    </items>
    <items>
      <name>PayrollIncome</name>
      <description>Payroll income</description>
    </items>
    <items>
      <name>PurchaseCostDiscrepancies</name>
      <description>Purchase cost discrepancies</description>
    </items>
    <items>
      <name>PurchaseReturn</name>
      <description>Purchase return</description>
    </items>
    <items>
      <name>Revenue</name>
      <description>Revenue</description>
    </items>
    <items>
      <name>SalesReturn</name>
      <description>Sales return</description>
    </items>
    <items>
      <name>CostOfSales</name>
      <description>Write-off over/under allocated manufacturing overheads to COGS</description>
    </items>
  </predefined>
  <attributes>
    <name>IncomeAndExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Documents/FixedAssetDepreciationChanges/Forms/DocumentForm/Module.bsl
#Region Variables

&AtClient
Var ThisIsNewRow;

#EndRegion

#Region Private

&AtServer
// Procedure fills the exchange rates table
//
Procedure FillTableFixedAssets()
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	DepreciationParametersSliceLast.FixedAsset AS FixedAsset,
	|	DepreciationParametersSliceLast.StructuralUnit AS Department,
	|	DepreciationParametersSliceLast.AmountOfProductsServicesForDepreciationCalculation AS AmountOfProductsServicesForDepreciationCalculation,
	|	DepreciationParametersSliceLast.CostForDepreciationCalculation AS CostForDepreciationCalculation,
	|	DepreciationParametersSliceLast.UsagePeriodForDepreciationCalculation AS UsagePeriodForDepreciationCalculation,
	|	&DepreciationCharge AS ExpenseItem,
	|	&OtherIncome AS RevaluationItem,
	|	CASE
	|		WHEN &UseDefaultTypeOfAccounting
	|			THEN DepreciationParametersSliceLast.GLExpenseAccount
	|		ELSE VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef)
	|	END AS GLExpenseAccount,
	|	DepreciationParametersSliceLast.BusinessLine AS BusinessLine
	|FROM
	|	InformationRegister.FixedAssetParameters.SliceLast(&DocumentDate, Company = &Company) AS DepreciationParametersSliceLast";
	
	Query.SetParameter("DocumentDate", DocumentDate);
	Query.SetParameter("Company", ParentCompany);
	Query.SetParameter("UseDefaultTypeOfAccounting", UseDefaultTypeOfAccounting);
	Query.SetParameter("DepreciationCharge", Catalogs.DefaultIncomeAndExpenseItems.GetItem("DepreciationCharge"));
	Query.SetParameter("OtherIncome", Catalogs.DefaultIncomeAndExpenseItems.GetItem("OtherIncome"));
	
	QueryResultTable = Query.Execute().Unload();
	TableFixedAssets.Load(QueryResultTable);
	
EndProcedure

&AtServerNoContext
Function GetCompanyDataOnChange(Company)
	
	StructureData = New Structure();
	StructureData.Insert("ParentCompany", DriveServer.GetCompany(Company));
	
	If Company = Catalogs.Companies.EmptyRef() Then
		DocumentCurrency = Catalogs.Currencies.EmptyRef()
	Else
		DocumentCurrency = DriveServer.GetPresentationCurrency(Company);
	EndIf;
	
	StructureData.Insert("DocumentCurrency", DocumentCurrency);
	
	Return StructureData;
	
EndFunction

&AtServer
Procedure CompanyOnChangeAtServer()
	
	StructureData = GetCompanyDataOnChange(Object.Company);
	ParentCompany = StructureData.ParentCompany;
	DocumentCurrency = StructureData.DocumentCurrency;
	
	FillTableFixedAssets();
	
EndProcedure

&AtServer
// Receives the set of data from the server for the ProductsOnChange procedure.
//
Function GetDataFixedAsset(FixedAsset)
	
	StructureData = New Structure;
	StructureData.Insert("MethodOfDepreciationProportionallyProductsAmount", FixedAsset.DepreciationMethod = Enums.FixedAssetDepreciationMethods.ProportionallyToProductsVolume);
	
	FillAddedColumns();
	
	Return StructureData;
	
EndFunction

&AtServer
Procedure FillAddedColumns(GetGLAccounts = False)
	
	ObjectParameters = IncomeAndExpenseItemsInDocuments.GetObjectParameters(Object);
	GLAccountsInDocuments.CompleteObjectParameters(Object, ObjectParameters);
	
	FixedAssets = IncomeAndExpenseItemsInDocuments.GetStructureData(ObjectParameters, "FixedAssets", Object);
	GLAccountsInDocuments.CompleteStructureData(FixedAssets, ObjectParameters, "FixedAssets");
	
	StructureArray = New Array();
	StructureArray.Add(FixedAssets);
	
	GLAccountsInDocuments.FillGLAccountsInArray(Object, StructureArray, GetGLAccounts);
	
EndProcedure

&AtClientAtServerNoContext
Function AccountOnChangeStructure(Object, AccountName)
	
	StructureData = New Structure("
	|TabName,
	|Object,
	|IncomeAndExpenseItems,
	|IncomeAndExpenseItemsFilled,
	|ExpenseItem,
	|RegisterExpense,
	|RevaluationItem,
	|RegisterRevaluation");
	StructureData.Object = Object;
	StructureData.TabName = "FixedAssets";
	
	StructureData.Insert(AccountName);
	
	Return StructureData;
	
EndFunction

&AtServerNoContext
Function IsIncomeAndExpenseGLA(Account)
	Return GLAccountsInDocumentsServerCall.IsIncomeAndExpenseGLA(Account);
EndFunction

&AtClient
Procedure Attachable_ProcessDateChange()
	
	DocumentDate = Object.Date;
	
	FillTableFixedAssets();
	
EndProcedure

#EndRegion

#Region FormEventHandlers

&AtServer
// Procedure - OnCreateAtServer event handler.
// The procedure implements
// - form attribute initialization,
// - setting of the form functional options parameters.
//
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	DriveServer.FillDocumentHeader(
		Object,
		,
		Parameters.CopyingValue,
		Parameters.Basis,
		PostingIsAllowed,
		Parameters.FillingValues);
	
	If ValueIsFilled(Object.Date) Then
		DocumentDate = Object.Date;
	Else
		DocumentDate = CurrentSessionDate();
	EndIf;
	
	ParentCompany = DriveServer.GetCompany(Object.Company);
	
	If Object.Company = Catalogs.Companies.EmptyRef() Then
		DocumentCurrency = Catalogs.Currencies.EmptyRef()
	Else 
		DocumentCurrency = DriveServer.GetPresentationCurrency(Object.Company);
	EndIf;
	
	UseDefaultTypeOfAccounting = GetFunctionalOption("UseDefaultTypeOfAccounting");
	
	FillTableFixedAssets();
	
	User = Users.CurrentUser();
	
	SettingValue = DriveReUse.GetValueByDefaultUser(User, "MainDepartment");
	MainDepartment = ?(ValueIsFilled(SettingValue), SettingValue, Catalogs.BusinessUnits.MainDepartment);
	
	FillAddedColumns();
	
	IncomeAndExpenseItemsInDocuments.SetRegistrationAttributesVisibility(
		ThisObject, "FixedAssetsRegisterExpense, FixedAssetsRegisterRevaluation", Not UseDefaultTypeOfAccounting);
	
	// StandardSubsystems.AdditionalReportsAndDataProcessors
	AdditionalReportsAndDataProcessors.OnCreateAtServer(ThisObject);
	// End StandardSubsystems.AdditionalReportsAndDataProcessors
	
	// StandardSubsystems.AttachableCommands
	AttachableCommands.OnCreateAtServer(ThisObject);
	// End StandardSubsystems.AttachableCommands
	
	// StandardSubsystems.ObjectVersioning
	ObjectsVersioning.OnCreateAtServer(ThisObject);
	// End StandardSubsystems.ObjectVersioning
	
EndProcedure

// Procedure - OnReadAtServer event handler.
//
&AtServer
Procedure OnReadAtServer(CurrentObject)
	
	FillAddedColumns();
	
	// StandardSubsystems.AttachableCommands
	AttachableCommandsClientServer.UpdateCommands(ThisObject, Object);
	// End StandardSubsystems.AttachableCommands
	
	// StandardSubsystems.EditProhibitionDates
	PeriodClosingDates.ObjectOnReadAtServer(ThisObject, CurrentObject);
	// End StandardSubsystems.EditProhibitionDates
	
	// Change of approved documents
	AccountingApprovalServer.OnReadAtServer(ThisObject, CurrentObject);
	// End Change of approved documents
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	// StandardSubsystems.AttachableCommands
	AttachableCommandsClient.StartCommandUpdate(ThisObject);
	// End StandardSubsystems.AttachableCommands
	
EndProcedure

&AtClient
// Procedure - event handler AfterWriting.
//
Procedure AfterWrite(WriteParameters)
	
	Notify("FixedAssetsStatesUpdate");
	Notify("RefreshAccountingTransaction");
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	// Change of approved documents
	AccountingApprovalServer.BeforeWriteAtServer(CurrentObject, Cancel, ThisObject);
	// End Change of approved documents
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	
	FillAddedColumns();
	
	If DocumentDate <> Object.Date Then
		DocumentDate = Object.Date;
		FillTableFixedAssets();
	EndIf;
	
EndProcedure

&AtClient
Procedure ChoiceProcessing(SelectedValue, ChoiceSource)
	
	If IncomeAndExpenseItemsInDocumentsClient.IsIncomeAndExpenseItemsChoiceProcessing(ChoiceSource.FormName) Then
		IncomeAndExpenseItemsInDocumentsClient.IncomeAndExpenseItemsChoiceProcessing(ThisObject, SelectedValue);
	EndIf;
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
// Procedure - event handler OnChange of the Date input field.
// The procedure determines the situation when after changing the date
// of a document this document is found in another period
// of documents enumeration, and in this case the procedure assigns new unique number to the document.
// Overrides the corresponding form parameter.
//
Procedure DateOnChange(Item)
	
	DriveClient.ProcessDateChange(ThisObject);
	
EndProcedure

&AtClient
// Procedure - event handler OnChange of the Company input field.
// In procedure the document number
// is cleared, and also the form functional options are configured.
// Overrides the corresponding form parameter.
//
Procedure CompanyOnChange(Item)
	
	// Company change event data processor.
	Object.Number = "";
	
	CompanyOnChangeAtServer();
	
EndProcedure

&AtClient
Procedure CommentStartChoice(Item, ChoiceData, StandardProcessing)
	
	CommonClient.ShowCommentEditingForm(Item.EditText, ThisObject);
	
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlersFixedAssets

&AtClient
// Procedure - event handler OnStartEdit of the FixedAssets list row.
//
Procedure FixedAssetsOnStartEdit(Item, NewRow, Copy)
	
	If NewRow Then
		TabularSectionRow = Items.FixedAssets.CurrentData;
		TabularSectionRow.StructuralUnit = MainDepartment;
	EndIf;
	
	IncomeAndExpenseItemsInDocumentsClient.TableOnStartEnd(Item, NewRow, Copy);
	
EndProcedure

&AtClient
// Procedure - event handler OnChange of the WorksProductsVolumeForDepreciationCalculation input field 
// in the row of the FixedAssets
// tabular section.
//
Procedure FixedAssetsVolumeProductsWorksForDepreciationCalculationOnChange(Item)
	
	TabularSectionRow = Items.FixedAssets.CurrentData;
	StructureData = GetDataFixedAsset(TabularSectionRow.FixedAsset);
	
	If Not StructureData.MethodOfDepreciationProportionallyProductsAmount Then
		ShowMessageBox(Undefined,NStr("en = '""Product (work) volume for calculating depreciation"" cannot be filled in for the specified depreciation method.'; ru = '""Объем продукции (работ) для исчисления амортизации"" не может быть заполнен для указанного способа начисления амортизации!';pl = 'Dla określonej metody amortyzacji nie można wypełnić pola ""Trwałość użyteczna do metody amortyzacji"".';es_ES = '""Volumen de productos (trabajos) para calcular la depreciación"" no puede rellenarse para el método de depreciación especificado.';es_CO = '""Volumen de productos (trabajos) para calcular la depreciación"" no puede rellenarse para el método de depreciación especificado.';tr = '""Amortisman hesaplamasında kullanılan ürün (iş) hacmi"", belirtilen amortisman tahakkuku yöntemi için doldurulmamıştır.';it = '""Il volume del prodotto (lavoro) per il calcolo degli ammortamenti"" non può essere compilato per il metodo di ammortamento specificato.';de = '""Produkt (Arbeit) Volumen zur Berechnung der Abschreibung"" kann für die angegebene Abschreibungsmethode nicht ausgefüllt werden.'"));
		TabularSectionRow.AmountOfProductsServicesForDepreciationCalculation = 0;
	EndIf;
	
EndProcedure

&AtClient
// Procedure - event handler OnChange of the UsagePeriodForDepreciationCalculation input field 
// in the row of the FixedAssets
// tabular section.
//
Procedure FixedAssetsUsagePeriodForDepreciationCalculationOnChange(Item)
	
	TabularSectionRow = Items.FixedAssets.CurrentData;
	StructureData = GetDataFixedAsset(TabularSectionRow.FixedAsset);
	
	If StructureData.MethodOfDepreciationProportionallyProductsAmount Then
		ShowMessageBox(Undefined,NStr("en = 'Cannot fill in ""Useful life for calculating depreciation"" for the specified method of depreciation.'; ru = '""Срок использования для вычисления амортизации"" не может быть заполнен для указанного способа начисления амортизации!';pl = 'Dla określonej metody amortyzacji nie można wypełnić pola ""Liczba miesięcy amortyzacji do obliczenia"".';es_ES = 'No se puede rellenar la ""Vida útil para calcular la depreciación"" para el método especificado de la depreciación.';es_CO = 'No se puede rellenar la ""Vida útil para calcular la depreciación"" para el método especificado de la depreciación.';tr = 'Belirtilen amortisman yöntemi için ""Amortismanın hesaplanması için yararlı ömür"" doldurulamaz.';it = 'Il ""Vita utile per il calcolo dell''ammortamento"" non può essere compilato per il metodo di calcolo dell''ammortamento specificato!';de = 'Für die angegebene Abschreibungsmethode kann die ""Nutzungsdauer für die Berechnung der Abschreibungen"" nicht angegeben werden.'"));
		TabularSectionRow.UsagePeriodForDepreciationCalculation = 0;
	EndIf;
	
EndProcedure

&AtClient
// Procedure - event handler OnChange of the
// FixedAsset input field in the row
// of the FixedAssets tabular section.
//
Procedure FixedAssetsFixedAssetOnChange(Item)
	
	CurrentData = Items.FixedAssets.CurrentData;
	
	FixedAssetsArray = TableFixedAssets.FindRows(New Structure("FixedAsset", CurrentData.FixedAsset));
	
	If FixedAssetsArray.Count() <> 0 Then
		
		CurrentData.UsagePeriodForDepreciationCalculation = FixedAssetsArray[0].UsagePeriodForDepreciationCalculation;
		CurrentData.AmountOfProductsServicesForDepreciationCalculation = FixedAssetsArray[0].AmountOfProductsServicesForDepreciationCalculation;
		CurrentData.CostForDepreciationCalculation = FixedAssetsArray[0].CostForDepreciationCalculation;
		CurrentData.CostForDepreciationCalculationBeforeChanging = FixedAssetsArray[0].CostForDepreciationCalculation;
		CurrentData.ExpenseItem = FixedAssetsArray[0].ExpenseItem;
		CurrentData.RevaluationItem = FixedAssetsArray[0].RevaluationItem;
		CurrentData.BusinessLine = FixedAssetsArray[0].BusinessLine;
		CurrentData.StructuralUnit = FixedAssetsArray[0].Department;
		
		If UseDefaultTypeOfAccounting Then
			CurrentData.GLExpenseAccount = FixedAssetsArray[0].GLExpenseAccount;
			CurrentData.RegisterExpense = IsIncomeAndExpenseGLA(CurrentData.GLExpenseAccount);
			CurrentData.RegisterRevaluation = IsIncomeAndExpenseGLA(CurrentData.RevaluationAccount);
		Else
			CurrentData.RegisterExpense = True;
			CurrentData.RegisterRevaluation = True;
		EndIf;
		
	Else
		CurrentData.UsagePeriodForDepreciationCalculation = 0;
		CurrentData.AmountOfProductsServicesForDepreciationCalculation = 0;
		CurrentData.CostForDepreciationCalculation = 0;
		CurrentData.CostForDepreciationCalculationBeforeChanging = 0;
	EndIf;
	
	StructureData = GetDataFixedAsset(CurrentData.FixedAsset);
	
	If StructureData.MethodOfDepreciationProportionallyProductsAmount Then
		CurrentData.UsagePeriodForDepreciationCalculation = 0;
	Else
		CurrentData.AmountOfProductsServicesForDepreciationCalculation = 0;
	EndIf;
	
EndProcedure

&AtClient
Procedure FixedAssetsIncomeAndExpenseItemsStartChoice(Item, ChoiceData, StandardProcessing)
	
	IncomeAndExpenseItemsInDocumentsClient.IncomeAndExpenseItemsStartChoice(ThisObject, "FixedAssets", StandardProcessing);
	
EndProcedure

&AtClient
Procedure FixedAssetsSelection(Item, SelectedRow, Field, StandardProcessing)
	
	If Field.Name = "FixedAssetsIncomeAndExpenseItems" Then
		StandardProcessing = False;
		IncomeAndExpenseItemsInDocumentsClient.OpenIncomeAndExpenseItemsForm(ThisObject, SelectedRow, "FixedAssets");
	EndIf;
	
EndProcedure

&AtClient
Procedure FixedAssetsOnActivateCell(Item)
	
	CurrentData = Items.FixedAssets.CurrentData;
	
	If CurrentData = Undefined Then
		Return;
	EndIf;
	
	If ThisIsNewRow Then
		TableCurrentColumn = Items.FixedAssets.CurrentItem;
		If TableCurrentColumn.Name = "FixedAssetsIncomeAndExpenseItems"
			And Not CurrentData.IncomeAndExpenseItemsFilled Then
			SelectedRow = Items.FixedAssets.CurrentRow;
			IncomeAndExpenseItemsInDocumentsClient.OpenIncomeAndExpenseItemsForm(ThisObject, SelectedRow, "FixedAssets");
		EndIf;
	EndIf;
	
EndProcedure

&AtClient
Procedure FixedAssetsOnEditEnd(Item, NewRow, CancelEdit)
	ThisIsNewRow = False;
EndProcedure

&AtClient
Procedure FixedAssetsGLExpenseAccountOnChange(Item)
	
	CurData = Items.FixedAssets.CurrentData;
	If CurData <> Undefined Then
		
		StructureData = AccountOnChangeStructure(Object, "GLExpenseAccount");
		FillPropertyValues(StructureData, CurData);
		
		GLAccountsInDocumentsServerCall.CheckItemRegistration(StructureData);
		FillPropertyValues(CurData, StructureData);
		
	EndIf;
	
EndProcedure

&AtClient
Procedure FixedAssetsRevaluationAccountOnChange(Item)
	
	CurData = Items.FixedAssets.CurrentData;
	If CurData <> Undefined Then
		
		StructureData = AccountOnChangeStructure(Object, "RevaluationAccount");
		FillPropertyValues(StructureData, CurData);
		
		GLAccountsInDocumentsServerCall.CheckItemRegistration(StructureData);
		FillPropertyValues(CurData, StructureData);
		
	EndIf;
	
EndProcedure

&AtClient
Procedure FixedAssetsRegisterExpenseOnChange(Item)
	
	CurrentData = Items.FixedAssets.CurrentData;
	
	If CurrentData <> Undefined And Not CurrentData.RegisterExpense Then
		CurrentData.ExpenseItem = PredefinedValue("Catalog.IncomeAndExpenseItems.EmptyRef");
		FillAddedColumns();
	EndIf;
	
EndProcedure

&AtClient
Procedure FixedAssetsRegisterRevaluationOnChange(Item)
	
	CurrentData = Items.FixedAssets.CurrentData;
	
	If CurrentData <> Undefined And Not CurrentData.RegisterRevaluation Then
		CurrentData.RevaluationItem = PredefinedValue("Catalog.IncomeAndExpenseItems.EmptyRef");
		FillAddedColumns();
	EndIf;
	
EndProcedure

#EndRegion

#Region LibrariesHandlers

// StandardSubsystems.AttachableCommands
&AtClient
Procedure Attachable_ExecuteCommand(Command)
	AttachableCommandsClient.ExecuteCommand(ThisObject, Command, Object);
EndProcedure

&AtServer
Procedure Attachable_ExecuteCommandAtServer(Context, Result)
	AttachableCommands.ExecuteCommand(ThisObject, Context, Object, Result);
EndProcedure

&AtClient
Procedure Attachable_UpdateCommands()
	AttachableCommandsClientServer.UpdateCommands(ThisObject, Object);
EndProcedure

// End StandardSubsystems.AttachableCommands

#EndRegion

#Region Initialize

ThisIsNewRow = False;

#EndRegion
